// Level 3
// 64011113
// 38. ให้นักศึกษาเขียนโปรแกรมเพื่อแสดงผลลัพธ์ผลรวมของตัวเลขในแต่ละแถว และแต่ละหลัก
/*
        Array ตัวอย่างขนาด 10 x 10
        95,68,95,42,65,31,42,51,42,68,
        59,74,21,35,62,14,21,35,26,28,
        29,24,16,25,42,36,25,16,24,25,
        32,12,36,24,15,32,16,95,75,85,
        62,43,19,86,24,37,19,65,53,28,
        64,29,21,53,24,16,58,75,14,25,
        35,62,95,86,47,85,78,14,63,29,
        86,47,68,32,12,36,69,86,74,48,
        46,26,53,69,78,46,14,21,34,26,
        38,69,47,28,34,16,24,28,59,68
*/
// SOL 01

#include<stdio.h> 
int main(){
    int x[10][10] = {
        95,68,95,42,65,31,42,51,42,68,
        59,74,21,35,62,14,21,35,26,28,
        29,24,16,25,42,36,25,16,24,25,
        32,12,36,24,15,32,16,95,75,85,
        62,43,19,86,24,37,19,65,53,28,
        64,29,21,53,24,16,58,75,14,25,
        35,62,95,86,47,85,78,14,63,29,
        86,47,68,32,12,36,69,86,74,48,
        46,26,53,69,78,46,14,21,34,26,
        38,69,47,28,34,16,24,28,59,68 } ;
    size_t n = sizeof(x)/sizeof(x[0]);
    int sumRow = 0, sumColumn = 0;

    for (int cR = 0; cR < n ; cR++){
        printf("Sum of row %d : ", cR+1);
        for (int cC = 0; cC < n ; cC++){
            printf("%d ", x[cR][cC]);
            sumRow += x[cR][cC]; 
            if (cC == n-1)  {
                printf("= %d\n", sumRow);
            }
            else printf("+ ");
        }
        sumRow = 0;
    }
    printf("\n");
    for(int cC = 0; cC < n; cC++){
        printf("Sum of column %d : ", cC+1);
        for (int cR = 0; cR < n ; cR++){
            printf("%d ", x[cR][cC]);
            sumColumn += x[cR][cC]; 
            if (cR == n-1)  {
                printf("= %d\n", sumColumn);
            }
            else printf("+ ");
        }
        sumColumn = 0;
    }
    return 0;
}