// Level 3
// 64011113
// 38. ให้นักศึกษาเขียนโปรแกรมเพื่อแสดงผลลัพธ์ผลรวมของตัวเลขในแต่ละแถว และแต่ละหลัก
/*
        Array ตัวอย่างขนาด 10 x 10
        95,68,95,42,65,31,42,51,42,68,
        59,74,21,35,62,14,21,35,26,28,
        29,24,16,25,42,36,25,16,24,25,
        32,12,36,24,15,32,16,95,75,85,
        62,43,19,86,24,37,19,65,53,28,
        64,29,21,53,24,16,58,75,14,25,
        35,62,95,86,47,85,78,14,63,29,
        86,47,68,32,12,36,69,86,74,48,
        46,26,53,69,78,46,14,21,34,26,
        38,69,47,28,34,16,24,28,59,68
*/
// SOL 02

#include<stdio.h> 
void sumArray();
int x[10][10] = {
        95,68,95,42,65,31,42,51,42,68,
        59,74,21,35,62,14,21,35,26,28,
        29,24,16,25,42,36,25,16,24,25,
        32,12,36,24,15,32,16,95,75,85,
        62,43,19,86,24,37,19,65,53,28,
        64,29,21,53,24,16,58,75,14,25,
        35,62,95,86,47,85,78,14,63,29,
        86,47,68,32,12,36,69,86,74,48,
        46,26,53,69,78,46,14,21,34,26,
        38,69,47,28,34,16,24,28,59,68 } ;
size_t n = sizeof(x)/sizeof(x[0]);

int main(){
    for (int n2 = 1; n2 <= 2 ; n2++){
        for (int n1 = 0; n1 < n; n1++){
            if (n2 == 1) {sumArray(n1, "row");}
            else {sumArray(n1, "column");}
        }
    }
    return 0;
}
void sumArray (int cNew, char type[6]) {
    printf("Sum of %s %d : ", type, cNew+1);
    int sum, a1, a2;
    for(int cNew_round = 0; cNew_round < n ; cNew_round++){
        if(type == "row") { 
            a1 = cNew;
            a2 = cNew_round;
        }
        else if (type == "column") { 
            a1 = cNew_round;
            a2 = cNew;
        }
        printf ("%d ", x[a1][a2]);
        sum += x[a1][a2];
        if (cNew_round == n-1)  {printf("= %d\n", sum);}
        else                    {printf("+ ");}
    }
    sum = 0;
}